NguyenGiap203/VXL_2110142_Lab1/STM32_Lab1_1st/Led_Animations1/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_RED_Pin GPIO_PIN_5
#define LED_RED_GPIO_Port GPIOA
#define LED_YELLOW_Pin GPIO_PIN_6
#define LED_YELLOW_GPIO_Port GPIOA
#define LED_GREEN_Pin GPIO_PIN_7
#define LED_GREEN_GPIO_Port GPIOA
#define SEG2_Pin GPIO_PIN_10
#define SEG2_GPIO_Port GPIOB
#define SEG3_Pin GPIO_PIN_11
#define SEG3_GPIO_Port GPIOB
#define SEG4_Pin GPIO_PIN_12
#define SEG4_GPIO_Port GPIOB
#define SEG5_Pin GPIO_PIN_13
#define SEG5_GPIO_Port GPIOB
#define SEG6_Pin GPIO_PIN_14
#define SEG6_GPIO_Port GPIOB
#define SEGA_Pin GPIO_PIN_8
#define SEGA_GPIO_Port GPIOA
#define SEGB_Pin GPIO_PIN_9
#define SEGB_GPIO_Port GPIOA
#define SEGC_Pin GPIO_PIN_10
#define SEGC_GPIO_Port GPIOA
#define SEGD_Pin GPIO_PIN_11
#define SEGD_GPIO_Port GPIOA
#define SEGE_Pin GPIO_PIN_12
#define SEGE_GPIO_Port GPIOA
#define SEGF_Pin GPIO_PIN_13
#define SEGF_GPIO_Port GPIOA
#define SEGG_Pin GPIO_PIN_14
#define SEGG_GPIO_Port GPIOA
#define LED_RED2_Pin GPIO_PIN_5
#define LED_RED2_GPIO_Port GPIOB
#define LED_YELLOW2_Pin GPIO_PIN_6
#define LED_YELLOW2_GPIO_Port GPIOB
#define LED_GREEN2_Pin GPIO_PIN_7
#define LED_GREEN2_GPIO_Port GPIOB
#define SEG0_Pin GPIO_PIN_8
#define SEG0_GPIO_Port GPIOB
#define SEG1_Pin GPIO_PIN_9
#define SEG1_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
